var dictionary = {
  kanji: [
    "阿", "以", "鵜", "絵", "尾",
    "課", "樹", "区", "毛", "個",
    "差", "氏", "巣", "瀬", "素",
    "他", "知", "津", "手", "都",
    "名", "二", "擢", "根", "野",
    "派", "日", "譜", "舳", "保",
    "魔", "御", "無", "目", "模",
    "屋", "遊", "夜",
    "等", "離", "留", "列", "露",
    "雲"],
  kanjiLengthWeighting: [2, 2, 2, 2, 2, 2, 1, 1, 1, 3, 3, 4],
  hiragana: [
    "あ", "い", "う", "え", "お",
    "か", "き", "く", "け", "こ",
    "さ", "し", "す", "せ", "そ",
    "た", "ち", "つ", "て", "と",
    "な", "に", "ぬ", "ね", "の",
    "は", "ひ", "ふ", "へ", "ほ",
    "ま", "み", "む", "め", "も",
    "や", "ゆ", "よ",
    "ら", "り", "る", "れ", "ろ",
    "ん",
    "っ", "ゃ", "ょ", "ゅ"],
  hiraganaLengthWeighting: [1, 1, 1, 1, 2, 2, 2, 3, 3, 4],
  katakana: [
    "ア", "イ", "ウ", "エ", "オ",
    "カ", "キ", "ク", "ケ", "コ",
    "サ", "シ", "ス", "セ", "ソ",
    "タ", "チ", "ツ", "テ", "ト",
    "ナ", "ニ", "ヌ", "ネ", "ノ",
    "ハ", "ヒ", "フ", "ヘ", "ホ",
    "マ", "ミ", "ム", "メ", "モ",
    "ヤ", "ユ", "ヨ",
    "ラ", "リ", "ル", "レ", "ロ",
    "ン",
    "ッ", "ャ", "ュ", "ョ", "ー"],
  katakanaLengthWeighting: [2, 2, 3, 3, 3, 3, 4, 4, 4, 4, 4, 5, 5, 5, 6, 6, 7],
  // [1:kanji, 2:hiragana, 3:katakana]
  mixWeighting: [1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 3],
};

module.exports = dictionary;